vedderb/vesc_bms_fw/ChibiOS_20.3.4/community/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123.h
 * |        |          |Bits PB3_MFP1 (ALT_MFP[27]) and GPB_MFP[3] determine the PB.3 function.
 * |        |          |(PB3_MFP1 (ALT_MFP[27]), GPB_MFP[3]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = UART0_nCTS function is selected.
 * |        |          |(1, 1) = TM3_EXT function is selected.
 * |[4]     |GPB_MFP4  |PB.4 Pin Function Selection
 * |        |          |Bits PB4_MFP1 (ALT_MFP[15]) and GPB_MFP[4] determine the PB.4 function.
 * |        |          |(PB4_MFP1 (ALT_MFP[15]), GPB_MFP[4]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = UART1_RXD function is selected.
 * |        |          |(1, 0) = SPI2_SS0 function is selected.
 * |        |          |(1, 1) = SPI1_SS1 function is selected.
 * |[5]     |GPB_MFP5  |PB. 5 Pin Function Selection
 * |        |          |Bits PB5_MFP1 (ALT_MFP[18]) and GPB_MFP[5] determine the PB.5 function.
 * |        |          |(PB5_MFP1 (ALT_MFP[18]), GPB_MFP[5]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = UART1_TXD function is selected.
 * |        |          |(1, 1) = SPI2_CLK function is selected.
 * |[6]     |GPB_MFP6  |PB.6 Pin Function Selection
 * |        |          |Bits PB6_MFP1 (ALT_MFP[17]) and GPB_MFP[6] determine the PB.6 function.
 * |        |          |(PB6_MFP1 (ALT_MFP[17]), GPB_MFP[6]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = UART1_nRTS function is selected.
 * |        |          |(1, 1) = SPI2_MOSI0 function is selected.
 * |[7]     |GPB_MFP7  |PB.7 Pin Function Selection
 * |        |          |Bits PB7_MFP1 (ALT_MFP[16]) and GPB_MFP[7] determine the PB.7 function.
 * |        |          |(PB7_MFP1 (ALT_MFP[16]), GPB_MFP[7]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = UART1_nCTS function is selected.
 * |        |          |(1, 1) = SPI2_MISO0 function is selected.
 * |[8]     |GPB_MFP8  |PB.8 Pin Function Selection
 * |        |          |Bit GPB_MFP[8] determines the PB.8 function.     
 * |        |          |0 = GPIO function is selected.
 * |        |          |1 = TM0 function is selected.
 * |[9]     |GPB_MFP9  |PB.9 Pin Function Selection
 * |        |          |Bits PB9_MFP1 (ALT_MFP[1]) and GPB_MFP[9] determine the PB.9 function.
 * |        |          |(PB9_MFP1 (ALT_MFP[1]), GPB_MFP[9]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = TM1 function is selected.
 * |        |          |(1, 0) = PWM1 function is selected. (NUC123xxxAEx Only)
 * |        |          |(1, 1) = SPI1_SS1 function is selected.     
 * |[10]    |GPB_MFP10 |PB.10 Pin Function Selection
 * |        |          |Bit GPB_MFP[10] determines the PB.10 function.
 * |        |          |(PB10_MFP1 (ALT_MFP[0]), GPB_MFP[10]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = TM2 function is selected.
 * |        |          |(1, 1) = SPI0_SS1 function is selected.
 * |[12]    |GPB_MFP12 |PB.12 Pin Function Selection
 * |        |          |Bits PB12_MFP1 (ALT_MFP[10]) and GPB_MFP[12] determine the PB.12 function.
 * |        |          |(PB12_MFP1 (ALT_MFP[10]), GPB_MFP[12]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI1_SS0 function is selected.
 * |        |          |(1, 1) = CLKO function is selected.
 * |[13]    |GPB_MFP13 |PB.13 Pin Function Selection
 * |        |          |Bit GPB_MFP[13] determines the PB.13 function.
 * |        |          |0 = GPIO function is selected.
 * |[14]    |GPB_MFP14 |PB.14 Pin Function Selection
 * |        |          |Bit GPB_MFP[14] determines PB.14 function.
 * |        |          |0 = GPIO function is selected.
 * |        |          |1 = INT0 function is selected.
 * |[15]    |GPB_MFP15 |PB.15 Pin Function Selection
 * |        |          |Bits PB15_MFP1 (ALT_MFP[24]) and GPB_MFP[15] determine the PB.15 function.
 * |        |          |(PB15_MFP1 (ALT_MFP[24]), GPB_MFP[15])  value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = INT1 function is selected.
 * |        |          |(1, 1) = TM0_EXT function is selected.
 * |[31:16] |GPB_TYPEn |Schmitt Trigger Function Selection
 * |        |          |0 = GPIOB[15:0] I/O input Schmitt Trigger function Disabled.
 * |        |          |1 = GPIOB[15:0] I/O input Schmitt Trigger function Enabled.
 * @var GCR_T::GPC_MFP
 * Offset: 0x38  GPIOC Multiple Function and Input Type Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |GPC_MFP0  |PC.0 Pin Function Selection
 * |        |          |Bits PC0_MFP1 (ALT_MFP[5]) and GPC_MFP[0] determine the PC.0 function.
 * |        |          |(PC0_MFP1 (ALT_MFP[5]), GPC_MFP[0]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_SS0 function is selected.
 * |        |          |(1, 1) = I2S_LRCLK function is selected.
 * |[1]     |GPC_MFP1  |PC.1 Pin Function Selection
 * |        |          |Bits PC1_MFP1 (ALT_MFP[6]) and GPC_MFP[1] determine the PC.1 function.
 * |        |          |(PC1_MFP1 (ALT_MFP[6]), GPC_MFP[1]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_CLK function is selected.
 * |        |          |(1, 1) = I2S_BCLK function is selected.
 * |[2]     |GPC_MFP2  |PC.2 Pin Function Selection
 * |        |          |Bits PC2_MFP1 (ALT_MFP[7]) and GPC_MFP[2] determine the PC.2 function.
 * |        |          |(PC2_MFP1 (ALT_MFP[7]), GPC_MFP[2]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_MISO0 function is selected.
 * |        |          |(1, 1) = I2S_DI function is selected.
 * |[3]     |GPC_MFP3  |PC.3 Pin Function Selection
 * |        |          |Bits PC3_MFP1 (ALT_MFP[8]) and GPC_MFP[3] determine the PC.3 function.
 * |        |          |(PC3_MFP1 (ALT_MFP[8]), GPC_MFP[3]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_MOSI0 function is selected.
 * |        |          |(1, 1) = I2S_DO function is selected.
 * |[4]     |GPC_MFP4  |PC.4 Pin Function Selection
 * |        |          |Bits PC4_MFP1 (ALT_MFP[29]) and GPC_MFP[4] determine the PC.4 function.
 * |        |          |(PC4_MFP1 (ALT_MFP[29]), GPC_MFP[4]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_MISO1 function is selected.
 * |        |          |(1, 1) = UART0_RXD function is selected.
 * |[5]     |GPC_MFP5  |PC.5 Pin Function Selection
 * |        |          |Bits PC5_MFP1 (ALT_MFP[30]) and GPC_MFP[5] determine the PC.5 function.
 * |        |          |(PC5_MFP1 (ALT_MFP[30]), GPC_MFP[5]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_MOSI1 function is selected.
 * |        |          |(1, 1) = UART0_TXD function is selected.
 * |[8]     |GPC_MFP8  |PC.8 Pin Function Selection
 * |        |          |Bits PC8_MFP1 (ALT_MFP1[23]) and GPC_MFP[8] determine the PC.8 function.
 * |        |          |(PC8_MFP1 (ALT_MFP1[23]), GPC_MFP[8]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI1_SS0 function is selected.
 * |        |          |(1, 1) = PWM0 function is selected. (NUC123xxxAEx Only) 
 * |[9]     |GPC_MFP9  |PC.9 Pin Function Selection
 * |        |          |Bit GPC_MFP[9] determines the PC.9 function.     
 * |        |          |0 = GPIO function is selected.
 * |        |          |1 = SPI1_CLK function is selected.
 * |[10]    |GPC_MFP10 |PC.10 Pin Function Selection
 * |        |          |Bit GPC_MFP[10] determines the PC.10 function.
 * |        |          |0 = GPIO function is selected.
 * |        |          |1 = SPI1_MISO0 function is selected.     
 * |[11]    |GPC_MFP11 |PC.11 Pin Function Selection
 * |        |          |Bit GPC_MFP[11] determines the PC.11 function.
 * |        |          |0 = GPIO function is selected.
 * |        |          |1 = SPI1_MOSI0 function is selected.     
 * |[12]    |GPC_MFP12 |PC.12 Pin Function Selection
 * |        |          |Bits PC12_MFP1 (ALT_MFP[20]) and GPC_MFP[12] determine the PC.12 function.
 * |        |          |(PC12_MFP1 (ALT_MFP[20]), GPC_MFP[12]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI1_MISO1 function is selected.
 * |        |          |(1, 0) = I2S_MCLK function is selected.
 * |        |          |(1, 1) = PWM2 function is selected.
 * |[13]    |GPC_MFP13 |PC.13 Pin Function Selection
 * |        |          |Bits PC13_MFP1 (ALT_MFP[21]) and GPC_MFP[13] determine the PC.13 function.
 * |        |          |(PC13_MFP1 (ALT_MFP[21]), GPC_MFP[13]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI1_MOSI1 function is selected.
 * |        |          |(1, 0) = CLKO function is selected.
 * |        |          |(1, 1) = PWM3 function is selected.
 * |[31:16] |GPC_TYPEn |Schmitt Trigger Function Selection
 * |        |          |0 = GPIOC[15:0] I/O input Schmitt Trigger function Disabled.
 * |        |          |1 = GPIOC[15:0] I/O input Schmitt Trigger function Enabled.
 * @var GCR_T::GPD_MFP
 * Offset: 0x3C  GPIOD Multiple Function and Input Type Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |GPD_MFP0  |PD.0 Pin Function Selection
 * |        |          |Bits PD0_MFP1 (ALT_MFP1[16]) and GPD_MFP[0] determine the PD.0 function.
 * |        |          |(PD0_MFP1 (ALT_MFP1[16]), GPD_MFP[0]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(1, 0) = SPI2_SS0 function is selected.
 * |        |          |(1, 1) = ADC0 function is selected.
 * |[1]     |GPD_MFP1  |PD.1 Pin Function Selection
 * |        |          |Bits PD1_MFP1 (ALT_MFP1[17]) and GPD_MFP[1] determine the PD.1 function.
 * |        |          |(PD1_MFP1 (ALT_MFP1[17]), GPD_MFP[1]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_SS1 function is selected.
 * |        |          |(1, 0) = SPI2_CLK function is selected.
 * |        |          |(1, 1) = ADC1 function is selected.
 * |[2]     |GPD_MFP2  |PD.2 Pin Function Selection
 * |        |          |Bits PD2_MFP1 (ALT_MFP1[18]) and GPD_MFP[2] determine the PD.2 function.
 * |        |          |(PD2_MFP1 (ALT_MFP1[18]), GPD_MFP[2]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_MISO1 function is selected.
 * |        |          |(1, 0) = SPI2_MISO0 function is selected.
 * |        |          |(1, 1) = ADC2 function is selected.
 * |[3]     |GPD_MFP3  |PD.3 Pin Function Selection
 * |        |          |Bits PD3_MFP1 (ALT_MFP1[19]) and GPD_MFP[3] determine the PD.3 function.
 * |        |          |(PD3_MPF1 (ALT_MFP1[19]), GPD_MFP[3]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_MOSI1 function is selected.
 * |        |          |(1, 0) = SPI2_MOSI0 function is selected.
 * |        |          |(1, 1) = ADC3 function is selected.
 * |[4]     |GPD_MFP4  |PD.4 Pin Function Selection
 * |        |          |Bits PD4_MFP1 (ALT_MFP1[20]) and GPD_MFP[4] determine the PD.4 function.
 * |        |          |(PD4_MFP1 (ALT_MFP1[20]), GPD_MFP[4]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(1, 0) = SPI2_MISO1 function is selected.
 * |        |          |(1, 1) = ADC4 function is selected.
 * |[5]     |GPD_MFP5  |PD.5 Pin Function Selection
 * |        |          |Bits PD5_MFP1 (ALT_MFP1[21]) and GPD_MFP[5] determine the PD.5 function.
 * |        |          |(PD5_MFP1 (ALT_MFP1[21]), GPD_MFP[5]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(1, 0) = SPI2_MOSI1 function is selected.
 * |        |          |(1, 1) = ADC5 function is selected.
 * |[8]     |GPD_MFP8  |PD.8 Pin Function Selection
 * |        |          |Bit GPD_MFP[8] determines the PD.8 function.     
 * |        |          |0 = GPIO function is selected.
 * |        |          |1 = SPI1_MOSI0 function is selected.
 * |[9]     |GPD_MFP9  |PD.9 Pin Function Selection
 * |        |          |it GPD_MFP[9] determines the PD.9 function.
 * |        |          |0 = GPIO function is selected.
 * |[10]    |GPD_MFP10 |PD.10 Pin Function Selection
 * |        |          |Bit GPD_MFP[10] determines the PD.10 function.     
 * |        |          |0 = GPIO function is selected.
 * |        |          |1 = CLKO function is selected.
 * |[11]    |GPD_MFP11 |PD.11 Pin Function Selection
 * |        |          |Bit GPD_MFP[11] determines the PD.11 function.
 * |        |          |0 = GPIO function is selected.
 * |        |          |1 = INT1 function is selected.     
 * |[31:16] |GPD_TYPEn |Schmitt Trigger Function Selection
 * |        |          |0 = GPIOD[15:0] I/O input Schmitt Trigger function Disabled. 
 * |        |          |1 = GPIOD[15:0] I/O input Schmitt Trigger function Enabled.
 * @var GCR_T::GPF_MFP
 * Offset: 0x44  GPIOF Multiple Function and Input Type Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |GPF_MFP0  |PF.0 Pin Function Selection
 * |        |          |Bit GPF_MFP[0] determines the PF.0 function.
 * |        |          |0 = GPIO function is selected.
 * |        |          |1 = XT1_OUT function is selected.
 * |        |          |Note1: For NUC123xxxANx, the value of this bit is controlled by CGPFMFP (Config0[27]) when power-up, user can write this bit after chip power-up.
 * |        |          |Note2: For NUC123xxxAEx, the value of this bit is controlled by CGPFMFP (Config0[27]).         
 * |[1]     |GPF_MFP1  |PF.1 Pin Function Selection
 * |        |          |Bit GPF_MFP[1] determines the PF.1 function.
 * |        |          |0 = GPIO function is selected.
 * |        |          |1 = XT1_IN function is selected.
 * |        |          |Note1: For NUC123xxxANx, the value of this bit is controlled by CGPFMFP (Config0[27]) when power-up, user can write this bit after chip power-up.
 * |        |          |Note2: For NUC123xxxAEx, the value of this bit is controlled by CGPFMFP (Config0[27]).         
 * |[2]     |GPF_MFP2  |PF.2 Pin Function Selection
 * |        |          |Bits PF2_MFP1 (ALT_MFP1[25:24]) and GPF_MFP[2] determine the PF.2 function.
 * |        |          |(PF2_MFP1 (ALT_MFP1[25:24]), GPF_MFP[2]) value and function mapping are as following list.
 * |        |          |(00, 0) = GPIO function is selected.
 * |        |          |(00, 1) = PS2_DAT function is selected.
 * |        |          |(10, 1) = I2C0_SDA function is selected.
 * |        |          |(11, 1) = ADC6 function is selected.
 * |        |          |The reset value of this bit is 1.     
 * |[3]     |GPF_MFP3  |PF.3 Pin Function Selection
 * |        |          |Bits PF3_MFP1 (ALT_MFP1[27:26]) and GPF_MFP[3] determine the PF.3 function.
 * |        |          |(PF3_MFP1 (ALT_MFP1[27:26]), GPF_MFP[3]) value and function mapping are as following list.
 * |        |          |(00, 0) = GPIO function is selected.
 * |        |          |(00, 1) = PS2_CLK function is selected.
 * |        |          |(10, 1) = I2C0_SCL function is selected.
 * |        |          |(11, 1) = ADC7 function is selected.
 * |        |          |The reset value of this bit is 1.     
 * |[19:16] |GPF_TYPEn |Schmitt Trigger Function Selection
 * |        |          |0 = GPIOF[3:0] I/O input Schmitt Trigger function Disabled.
 * |        |          |1 = GPIOF[3:0] I/O input Schmitt Trigger function Enabled.
 * @var GCR_T::ALT_MFP
 * Offset: 0x50  Alternative Multiple Function Pin Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |PB10_MFP1 |PB.10 Pin Alternate Function Selection
 * |        |          |Bit GPB_MFP[10] determines the PB.10 function.
 * |        |          |(PB10_MFP1 (ALT_MFP[0]), GPB_MFP[10]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = TM2 function is selected.
 * |        |          |(1, 1) = SPI0_SS1 function is selected.
 * |[1]     |PB9_MFP1  |PB.9 Pin Alternate Function Selection
 * |        |          |Bits PB9_MFP1 (ALT_MFP[1]) and GPB_MFP[9] determine the PB.9 function.
 * |        |          |(PB9_MFP1 (ALT_MFP[1]), GPB_MFP[9]) value and function mapping are as following list.     
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = TM1 function is selected.
 * |        |          |(1, 0) = PWM1 function is selected. (NUC123xxxAEx Only)
 * |        |          |(1, 1) = SPI1_SS1 function is selected.   
 * |[5]     |PC0_MFP1  |PC.0 Pin Alternate Function Selection
 * |        |          |Bits PC0_MFP1 (ALT_MFP[5]) and GPC_MFP[0] determine the PC.0 function.
 * |        |          |(PC0_MFP1 (ALT_MFP[5]), GPC_MFP[0]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_SS0 function is selected.
 * |        |          |(1, 1) = I2S_LRCLK function is selected.
 * |[6]     |PC1_MFP1  |PC.1 Pin Alternate Function Selection
 * |        |          |Bits PC1_MFP1 (ALT_MFP[6]) and GPC_MFP[1] determine the PC.1 function.
 * |        |          |(PC1_MFP1 (ALT_MFP[6]), GPC_MFP[1]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_CLK function is selected.
 * |        |          |(1, 1) = I2S_BCLK function is selected.
 * |[7]     |PC2_MFP1  |PC.2 Pin Alternate Function Selection
 * |        |          |Bits PC2_MFP1 (ALT_MFP[7]) and GPC_MFP[2] determine the PC.2 function.
 * |        |          |(PC2_MFP1 (ALT_MFP[7]), GPC_MFP[2]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_MISO0 function is selected.
 * |        |          |(1, 1) = I2S_DI function is selected.
 * |[8]     |PC3_MFP1  |PC.3 Pin Alternate Function Selection
 * |        |          |Bits PC3_MFP1 (ALT_MFP[8]) and GPC_MFP[3] determine the PC.3 function.
 * |        |          |(PC3_MFP1 (ALT_MFP[8]), GPC_MFP[3]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_MOSI0 function is selected.
 * |        |          |(1, 1) = I2S_DO function is selected.
 * |[9]     |PA15_MFP1 |PA.15 Pin Alternate Function Selection
 * |        |          |Bits PA15_MFP1 (ALT_MFP[9]) and GPA_MFP[15] determine the PA.15 function.
 * |        |          |(PA15_MFP1 (ALT_MFP[9]), GPA_MFP[15]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = PWM3 function is selected.
 * |        |          |(1, 0) = CLKO function is selected.
 * |        |          |(1, 1) = I2S_MCLK function is selected.
 * |[10]    |PB12_MFP1 |PB.12 Pin Alternate Function Selection
 * |        |          |Bits PB12_MFP1 (ALT_MFP[10]) and GPB_MFP[12] determine the PB.12 function.
 * |        |          |(PB12_MFP1 (ALT_MFP[10]), GPB_MFP[12]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI1_SS0 function is selected.
 * |        |          |(1, 1) = CLKO function is selected.
 * |[11]    |PA11_MFP1 |PA.11 Pin Alternate Function Selection
 * |        |          |Bits PA11_MFP1 (ALT_MFP[11]) and GPA_MFP[11] determine the PA.11 function.
 * |        |          |(PA11_MFP1 (ALT_MFP[11]), GPA_MFP[11]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = I2C1_SCL function is selected.
 * |        |          |(1, 0) = SPI1_CLK function is selected.
 * |        |          |(1, 1) = SPI2_MOSI0 function is selected.
 * |[12]    |PA10_MFP1 |PA.10 Pin Alternate Function Selection
 * |        |          |Bits PA10_MFP1 (ALT_MFP[12]) and GPA_MFP[10] determine the PA.10 function.
 * |        |          |(PA10_MFP1 (ALT_MFP[12]), GPA_MFP[10]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = I2C1_SDA function is selected.
 * |        |          |(1, 0) = SPI1_MISO0 function is selected.
 * |        |          |(1, 1) = SPI2_MISO0 function is selected.
 * |[15]    |PB4_MFP1  |PB.4 Pin Alternate Function Selection
 * |        |          |Bits PB4_MFP1 (ALT_MFP[15]) and GPB_MFP[4] determine the PB.4 function.
 * |        |          |(PB4_MFP1 (ALT_MFP[15]), GPB_MFP[4]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = UART1_RXD function is selected.
 * |        |          |(1, 0) = SPI2_SS0 function is selected.
 * |        |          |(1, 1) = SPI1_SS1 function is selected.
 * |[16]    |PB7_MFP1  |PB.7 Pin Alternate Function Selection
 * |        |          |Bits PB7_MFP1 (ALT_MFP[16]) and GPB_MFP[7] determine the PB.7 function.
 * |        |          |(PB7_MFP1 (ALT_MFP[16]), GPB_MFP[7]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = UART1_nCTS function is selected.
 * |        |          |(1, 1) = SPI2_MISO0 function is selected.
 * |[17]    |PB6_MFP1  |PB.6 Pin Alternate Function Selection
 * |        |          |Bits PB6_MFP1 (ALT_MFP[17]) and GPB_MFP[6] determine the PB.6 function.
 * |        |          |(PB6_MFP1 (ALT_MFP[17]), GPB_MFP[6]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = UART1_nRTS function is selected.
 * |        |          |(1, 1) = SPI2_MOSI0 function is selected.
 * |[18]    |PB5_MFP1  |PB. 5 Pin Alternate Function Selection
