vedderb/vesc_bms_fw/ChibiOS_20.3.4/community/os/common/ext/CMSIS/Nuvoton/NUMICRO/NUC123.h
#define SYS_GPB_MFPH_GPB13_MFP_Pos               20                                         /*!< GCR_T::GPB_MFPH: GPB13_MFP Position */
#define SYS_GPB_MFPH_GPB13_MFP_Msk               (0x7ul << SYS_GPB_MFPH_GPB13_MFP_Pos)      /*!< GCR_T::GPB_MFPH: GPB13_MFP Mask */

#define SYS_GPB_MFPH_GPB12_MFP_Pos               16                                         /*!< GCR_T::GPB_MFPH: GPB12_MFP Position */
#define SYS_GPB_MFPH_GPB12_MFP_Msk               (0x7ul << SYS_GPB_MFPH_GPB12_MFP_Pos)      /*!< GCR_T::GPB_MFPH: GPB12_MFP Mask */

#define SYS_GPB_MFPH_GPB10_MFP_Pos               8                                          /*!< GCR_T::GPB_MFPH: GPB10_MFP Position */
#define SYS_GPB_MFPH_GPB10_MFP_Msk               (0x7ul << SYS_GPB_MFPH_GPB10_MFP_Pos)      /*!< GCR_T::GPB_MFPH: GPB10_MFP Mask */

#define SYS_GPB_MFPH_GPB9_MFP_Pos                4                                          /*!< GCR_T::GPB_MFPH: GPB9_MFP Position */
#define SYS_GPB_MFPH_GPB9_MFP_Msk                (0x7ul << SYS_GPB_MFPH_GPB9_MFP_Pos)       /*!< GCR_T::GPB_MFPH: GPB9_MFP Mask */

#define SYS_GPB_MFPH_GPB8_MFP_Pos                0                                          /*!< GCR_T::GPB_MFPH: GPB8_MFP Position */
#define SYS_GPB_MFPH_GPB8_MFP_Msk                (0x7ul << SYS_GPB_MFPH_GPB8_MFP_Pos)       /*!< GCR_T::GPB_MFPH: GPB8_MFP Mask */

/* GCR GPC_MFPL Bit Field Definitions */
#define SYS_GPC_MFPL_GPC5_MFP_Pos                20                                         /*!< GCR_T::GPC_MFPL: GPC5_MFP Position */
#define SYS_GPC_MFPL_GPC5_MFP_Msk                (0x7ul << SYS_GPC_MFPL_GPC5_MFP_Pos)       /*!< GCR_T::GPC_MFPL: GPC5_MFP Mask */

#define SYS_GPC_MFPL_GPC4_MFP_Pos                16                                         /*!< GCR_T::GPC_MFPL: GPC4_MFP Position */
#define SYS_GPC_MFPL_GPC4_MFP_Msk                (0x7ul << SYS_GPC_MFPL_GPC4_MFP_Pos)       /*!< GCR_T::GPC_MFPL: GPC4_MFP Mask */

#define SYS_GPC_MFPL_GPC3_MFP_Pos                12                                         /*!< GCR_T::GPC_MFPL: GPC3_MFP Position */
#define SYS_GPC_MFPL_GPC3_MFP_Msk                (0x7ul << SYS_GPC_MFPL_GPC3_MFP_Pos)       /*!< GCR_T::GPC_MFPL: GPC3_MFP Mask */

#define SYS_GPC_MFPL_GPC2_MFP_Pos                8                                          /*!< GCR_T::GPC_MFPL: GPC2_MFP Position */
#define SYS_GPC_MFPL_GPC2_MFP_Msk                (0x7ul << SYS_GPC_MFPL_GPC2_MFP_Pos)       /*!< GCR_T::GPC_MFPL: GPC2_MFP Mask */

#define SYS_GPC_MFPL_GPC1_MFP_Pos                4                                          /*!< GCR_T::GPC_MFPL: GPC1_MFP Position */
#define SYS_GPC_MFPL_GPC1_MFP_Msk                (0x7ul << SYS_GPC_MFPL_GPC1_MFP_Pos)       /*!< GCR_T::GPC_MFPL: GPC1_MFP Mask */

#define SYS_GPC_MFPL_GPC0_MFP_Pos                0                                          /*!< GCR_T::GPC_MFPL: GPC0_MFP Position */
#define SYS_GPC_MFPL_GPC0_MFP_Msk                (0x7ul << SYS_GPC_MFPL_GPC0_MFP_Pos)       /*!< GCR_T::GPC_MFPL: GPC0_MFP Mask */

/* GCR GPC_MFPH Bit Field Definitions */
#define SYS_GPC_MFPH_GPC13_MFP_Pos               20                                         /*!< GCR_T::GPC_MFPH: GPC13_MFP Position */
#define SYS_GPC_MFPH_GPC13_MFP_Msk               (0x7ul << SYS_GPC_MFPH_GPC13_MFP_Pos)      /*!< GCR_T::GPC_MFPH: GPC13_MFP Mask */

#define SYS_GPC_MFPH_GPC12_MFP_Pos               16                                         /*!< GCR_T::GPC_MFPH: GPC12_MFP Position */
#define SYS_GPC_MFPH_GPC12_MFP_Msk               (0x7ul << SYS_GPC_MFPH_GPC12_MFP_Pos)      /*!< GCR_T::GPC_MFPH: GPC12_MFP Mask */

#define SYS_GPC_MFPH_GPC11_MFP_Pos               12                                         /*!< GCR_T::GPC_MFPH: GPC11_MFP Position */
#define SYS_GPC_MFPH_GPC11_MFP_Msk               (0x7ul << SYS_GPC_MFPH_GPC11_MFP_Pos)      /*!< GCR_T::GPC_MFPH: GPC11_MFP Mask */

#define SYS_GPC_MFPH_GPC10_MFP_Pos               8                                          /*!< GCR_T::GPC_MFPH: GPC11_MFP Position */
#define SYS_GPC_MFPH_GPC10_MFP_Msk               (0x7ul << SYS_GPC_MFPH_GPC10_MFP_Pos)      /*!< GCR_T::GPC_MFPH: GPC11_MFP Mask */

#define SYS_GPC_MFPH_GPC9_MFP_Pos                4                                          /*!< GCR_T::GPC_MFPH: GPC9_MFP Position */
#define SYS_GPC_MFPH_GPC9_MFP_Msk                (0x7ul << SYS_GPC_MFPH_GPC9_MFP_Pos)       /*!< GCR_T::GPC_MFPH: GPC9_MFP Mask */

#define SYS_GPC_MFPH_GPC8_MFP_Pos                0                                          /*!< GCR_T::GPC_MFPH: GPC8_MFP Position */
#define SYS_GPC_MFPH_GPC8_MFP_Msk                (0x7ul << SYS_GPC_MFPH_GPC8_MFP_Pos)       /*!< GCR_T::GPC_MFPH: GPC8_MFP Mask */

/* GCR GPD_MFPL Bit Field Definitions */
#define SYS_GPD_MFPL_GPD5_MFP_Pos                20                                         /*!< GCR_T::GPD_MFPL: GPD5_MFP Position */
#define SYS_GPD_MFPL_GPD5_MFP_Msk                (0x7ul << SYS_GPD_MFPL_GPD5_MFP_Pos)       /*!< GCR_T::GPD_MFPL: GPD5_MFP Mask */

#define SYS_GPD_MFPL_GPD4_MFP_Pos                16                                         /*!< GCR_T::GPD_MFPL: GPD4_MFP Position */
#define SYS_GPD_MFPL_GPD4_MFP_Msk                (0x7ul << SYS_GPD_MFPL_GPD4_MFP_Pos)       /*!< GCR_T::GPD_MFPL: GPD4_MFP Mask */

#define SYS_GPD_MFPL_GPD3_MFP_Pos                12                                         /*!< GCR_T::GPD_MFPL: GPD3_MFP Position */
#define SYS_GPD_MFPL_GPD3_MFP_Msk                (0x7ul << SYS_GPD_MFPL_GPD3_MFP_Pos)       /*!< GCR_T::GPD_MFPL: GPD3_MFP Mask */

#define SYS_GPD_MFPL_GPD2_MFP_Pos                8                                          /*!< GCR_T::GPD_MFPL: GPD2_MFP Position */
#define SYS_GPD_MFPL_GPD2_MFP_Msk                (0x7ul << SYS_GPD_MFPL_GPD2_MFP_Pos)       /*!< GCR_T::GPD_MFPL: GPD2_MFP Mask */

#define SYS_GPD_MFPL_GPD1_MFP_Pos                4                                          /*!< GCR_T::GPD_MFPL: GPD1_MFP Position */
#define SYS_GPD_MFPL_GPD1_MFP_Msk                (0x7ul << SYS_GPD_MFPL_GPD1_MFP_Pos)       /*!< GCR_T::GPD_MFPL: GPD1_MFP Mask */

#define SYS_GPD_MFPL_GPD0_MFP_Pos                0                                          /*!< GCR_T::GPD_MFPL: GPD0_MFP Position */
#define SYS_GPD_MFPL_GPD0_MFP_Msk                (0x7ul << SYS_GPD_MFPL_GPD0_MFP_Pos)       /*!< GCR_T::GPD_MFPL: GPD0_MFP Mask */

/* GCR GPD_MFPH Bit Field Definitions */
#define SYS_GPD_MFPH_GPD11_MFP_Pos               12                                         /*!< GCR_T::GPD_MFPH: GPD11_MFP Position */
#define SYS_GPD_MFPH_GPD11_MFP_Msk               (0x7ul << SYS_GPD_MFPH_GPD11_MFP_Pos)      /*!< GCR_T::GPD_MFPH: GPD11_MFP Mask */

#define SYS_GPD_MFPH_GPD10_MFP_Pos               8                                          /*!< GCR_T::GPD_MFPH: GPD10_MFP Position */
#define SYS_GPD_MFPH_GPD10_MFP_Msk               (0x7ul << SYS_GPD_MFPH_GPD10_MFP_Pos)      /*!< GCR_T::GPD_MFPH: GPD10_MFP Mask */

